{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_2", "trainable": true, "batch_input_shape": [null, 228], "dtype": "float32", "input_dim": 15000, "output_dim": 150, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 228}}, {"class_name": "Conv1D", "config": {"name": "conv1d_8", "trainable": true, "filters": 256, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_9", "trainable": true, "filters": 128, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_5", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_10", "trainable": true, "filters": 64, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_6", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_11", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_7", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_12", "trainable": true, "filters": 16, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_8", "trainable": true, "strides": [2], "pool_size": [2], "padding": "valid"}}, {"class_name": "Conv1D", "config": {"name": "conv1d_13", "trainable": true, "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv1D", "config": {"name": "conv1d_14", "trainable": true, "filters": 8, "kernel_size": [3], "strides": [1], "padding": "same", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.1, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 180, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 2, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "binary_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of3", "group1-shard2of3", "group1-shard3of3"], "weights": [{"name": "conv1d_10/kernel", "shape": [3, 128, 64], "dtype": "float32"}, {"name": "conv1d_10/bias", "shape": [64], "dtype": "float32"}, {"name": "conv1d_11/kernel", "shape": [3, 64, 32], "dtype": "float32"}, {"name": "conv1d_11/bias", "shape": [32], "dtype": "float32"}, {"name": "conv1d_12/kernel", "shape": [3, 32, 16], "dtype": "float32"}, {"name": "conv1d_12/bias", "shape": [16], "dtype": "float32"}, {"name": "conv1d_13/kernel", "shape": [3, 16, 8], "dtype": "float32"}, {"name": "conv1d_13/bias", "shape": [8], "dtype": "float32"}, {"name": "conv1d_14/kernel", "shape": [3, 8, 8], "dtype": "float32"}, {"name": "conv1d_14/bias", "shape": [8], "dtype": "float32"}, {"name": "conv1d_8/kernel", "shape": [3, 150, 256], "dtype": "float32"}, {"name": "conv1d_8/bias", "shape": [256], "dtype": "float32"}, {"name": "conv1d_9/kernel", "shape": [3, 256, 128], "dtype": "float32"}, {"name": "conv1d_9/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [112, 180], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [180], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [180, 2], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [2], "dtype": "float32"}, {"name": "embedding_2/embeddings", "shape": [15000, 150], "dtype": "float32"}]}]}